Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E21C.tmx
Source language: en_us
Languages: zh_cn

source: How to Buy the Right Running Shoes
zh_cn: 怎样买正确的跑步鞋

source: Choosing the right running shoes is one of the most important decisions you can make as a runner.
zh_cn: 作为跑步者，其中一个重要的决定就是选择正确的跑步鞋，特别如果是刚刚开始。

source: Spending the time and money to get the best shoes for you will help keep you running comfortably and injury-free.
zh_cn: 花费点时间和精力去找到最好的跑步鞋可以帮助你保持舒服和健康。

source: Go straight to the experts at a running specialty store.
zh_cn: 直接去专卖店找专家。

source: Plan on spending some time there because the salesperson should ask you lots of questions and have several options for you to try out.
zh_cn: 计划花点时间在那儿因为销售员应该会问你很多问题，给你试穿几种跑步鞋。

source: Make sure the salesperson looks at the shape and arch to figure out what type of foot (high arches or flat feet, for example) you have.
zh_cn: 确保销售员看了脚的形状和拱，断定你的脚型是哪一种。

source: Determining your foot type is key to making sure you get the right running shoes.
zh_cn: 决定你的脚型是你得到正确的跑步鞋的关键。

source: The salesperson should also measure your foot.
zh_cn: 销售员还应该测量你的脚。

source: Even if you've been the same size for years, your foot length may change due to pregnancy or falling arches. Your running shoes should be 1/2 to a full size bigger than your regular shoe size because your feet will swell when you run and you need plenty of room in the toebox.
zh_cn: 你的跑步鞋应该比你平时的鞋子的尺码大1/2到1，因为当你跑步的时候你的脚会流汗，你脚趾部分需要大量的空间。

source: If your toes are crammed in the front of the running shoe, you could develop blisters or black toenails.
zh_cn: 如果你的脚趾在跑步鞋前面挤满了，你可能会瘀伤或者黑脚l趾甲。

source: Have the salesperson do a running analysis for you.
zh_cn: 让销售员给你做一个跑步分析。

source: He'll watch you run in the running shoes, either outside or on treadmill, and determine your running style.
zh_cn: 他会注视着你穿跑步鞋跑步，在外面或者是在跑步机上，然后决定你的跑步风格。

source: He'll observe whether you're overpronating (your foot rolls inward) or supinating (your foot rolls outward) when your foot strikes the ground.
zh_cn: 在你脚着地时他会观察你是否是过度足外翻（你的底辊向内）或者是内翻（你的底辊向外）。

source: Give the salesperson information that will help him with his running shoe recommendations.
zh_cn: 给销售员一些信息，这样会帮助他有关鞋子的推荐。

source: He should be asking you questions about what type of running you do, how often you run, where you typically run, if you're training for a race, and what type of surfaces you run on.
zh_cn: 他应该问你一些问题关于你做什么类型的跑步，多久跑一次，一般在哪儿跑，和你在什么类型的表面上跑。

source: Run in the running shoes that the salesperson recommends for you. (Make sure you're dressed to run when you're shopping!)
zh_cn: 穿着销售员为你推荐的鞋跑步。（当你买的时候一定要穿着跑跑！）

source: Simply trying on the shoes and walking a few steps inside the store is not enough.
zh_cn: 仅仅试穿一下，在店内走几步是不够的。

source: Run in each pair of shoes to test for fit, function, and comfort before making your final decision.
zh_cn: 在你最后做决定前，穿着每双鞋做合脚，功能和舒适度的测试。

source: Test your running shoes by running in them for a week.
zh_cn: 穿着你的跑步鞋一周来测试你的鞋。

source: If you quickly develop blisters or foot pain, they may not be the right shoes for you.
zh_cn: 如果你很快地起水疱 或者脚痛，他们可能不是合适的鞋。

source: Many specialty running stores have liberal exchange policies and allow you to return running shoes even if you've been running in them for a week or more.
zh_cn: 许多专卖店有自由交换的政策，允许你返还跑步鞋即使你已经用了一个礼拜或者更久。

source: Take them back and exchange them for another recommended pair of running shoes.
zh_cn: 把他们拿回去，拿他们换另外一双推荐的跑步鞋。

source: After you've found your perfect running shoes, you don't have to keep going back to the specialty running shop.
zh_cn: 在你找到完美的跑步鞋后，不需要常常返回专卖店。

source: You'll need to replace your shoes every 300-400 miles.
zh_cn: 你需要每300-400英里替换你的鞋子。
